{"lecturer":[{"name":"Utrecht University, Utrecht, the Netherlands","url":"https://osiris-student.uu.nl/onderwijscatalogus/extern/cursus","position":"Advanced Quantitative Methods (INFOMQNM)","startDate":"2023","endDate":"2026","summary":"Course taught in English for first-year Master’s students in Human–Computer Interaction, combining lectures with hands-on learning. The course covers research study design and hypothesis testing, including data preparation and parametric and non-parametric statistical analyses.","highlights":["Taught annually for four consecutive years","Co-designed the course curriculum and learning objectives","Planned the course schedule and set up the e-learning environment (on Blackboard and Brightspace)","Designed and delivered several full lectures","Designed and coordinated multiple hands-on practical sessions with formative exercises","Designed, graded, and provided feedback on multiple home assignments and the final exam"]},{"name":"Utrecht University, Utrecht, the Netherlands","url":"https://osiris-student.uu.nl/onderwijscatalogus/extern/cursus","position":"Interaction Technology Innovation (INFOMITI)","startDate":"2024","endDate":"2025","summary":"Course taught in English for first-year Master’s students from different programs (Human-Computer Interaction, Aritificial Intelligence, Business Informatics, etc.).  The course offers a practice-oriented learning experience in which students engage in a user-centered design process where they conduct user research, and iteratively prototype solutions based on user feedback. The course combines lectures, prototyping lab sessions, and skills workshops (e.g., 3D printing).","highlights":["Taught annually for two consecutive years","Revised and enhanced existing course materials, and delivered several full lectures","Designed and coordinated 3D modeling skills workshops","Planned the course schedule and set up the e-learning environment (on Blackboard)","Supervised multiple hands-on practical and lab sessions","Graded presentations as well as formative and summative assignments"]}],"supervision":[{"name":"Utrecht University, Utrecht, the Netherlands","url":"","position":"Daily supervisor, Master thesis, Human-Computer Interaction","startDate":"2024-12","endDate":"2025-07","summary":"Daily supervision includes weekly meetings and frequent formative feedback on research methods and written parts of the thesis.","highlights":["Thesis title: Speech Prediction And Real-time Suggestions (SPARS) for people who stutter","Topic: Stuttering affects millions of people worldwide and can negatively impact communication, mental health, and social well-being. Existing therapies and technologies often lack real-time, personalized support during everyday speech. This work explores an AI-based approach that provides immediate, tailored word suggestions while speaking, aiming to reduce stuttering and support more fluent communication.","The thesis is currently in the process of being turned into a paper; submission expected early 2026."]},{"name":"Utrecht University, Utrecht, the Netherlands","position":"Daily (co-)supervisor, Master thesis, Computing Science and Artificial Intelligence","startDate":"2023-10","endDate":"2025-03","summary":"Daily supervision includes weekly meetings and frequent formative feedback on research methods and written parts of the thesis. This student had 2 daily supervisors.","highlights":["Thesis title: Learning Complementary Latent Representations of Unknown Dynamics using Predictive Encoder-Decoder Models in Control Systems","Topic: Many control systems contain hidden parameters that are difficult to learn from data alone. The thesis introduces a model that separates short-term and long-term information to better capture these hidden effects while limiting error accumulation over long sequences. The model is tested with a simulated race car scenario."]},{"name":"Utrecht University, Utrecht, the Netherlands","position":"First supervisor, Bachelor thesis, Information Sciences","startDate":"2024-11","endDate":"2025-02","summary":"First supervision includes weekly meetings, frequent formative feedback on research methods and written parts of the thesis, and final grading.","highlights":["Thesis title: Deceptive Design Occupies Our Minds: How Dark Patterns Affect Cognitive Load","Topic: Dark patterns are deceptive design practices that can influence users to make unintended choices. This work explores how such interface elements may affect users’ cognitive load and decision-making."]}],"evaluation and improvements":[{"date":"2024-04","title":"University Teaching Qualification course","awarder":"Utrecht University, Utrecht, the Netherlands","summary":"9-weeks course constructed around three modules: (1) Designing a course, (2) Designing assessments and giving feedback, and (3) Teaching."},{"date":"2024-04","title":"Caracal evaluations","awarder":"Utrecht University, Utrecht, the Netherlands","summary":"TODO."},{"date":"2024-04","title":"Supervision evaluations","awarder":"Utrecht University, Utrecht, the Netherlands","summary":"TODO."},{"date":"2021-02-11","title":"ChatGPT assignments","awarder":"TODO","summary":"TODO"}]}